post/Games/unciv/Unciv.org
#+TITLE: Unciv简介与黑话笔记
#+DATE: <2023-06-07 三 11:58>
#+description: 一款仿照文明5的开源文明模拟策略游戏

#+setupfile: ../../../setup.setup

* Unciv简介
** 简介
Unciv是一款仿照文明5的，用Java编写的，对模组有好的，易于运行的文明模拟游戏。而其
[[https://github.com/yairm210/Unciv][官网]]的介绍为：
#+begin_quote
An open source, mod-friendly Android and Desktop remake of Civ V, made with
LibGDX
#+end_quote
你或许会问：“一个仿制文明5制作的游戏，好玩吗？”实际上，在游戏性上，他是绝对不
输文明5的，有着相当完善的功能和玩法。同时，在文章编写时，游戏的开发仍旧非常活跃，
能够“肉眼可见”地看见功能的加入和完善——对的，尽管这是一款英文游戏，但是有着很高
的翻译完成度，足见玩家的热情。
** 下载&安装
它的官网（Github）已经给出了完整的下载渠道，基于Java的特性，它基本支持全平台。抛
开Java依赖的大小后，其本体的大小还是非常小的。尽管在官网上Falthub、windows、
android三个平台的安装包大小如下： =109M= =85M= =19M=[fn:1]。

值得注意的是，Android平台上建议使用F-droid下载，因为谷歌没有魔法根本连不上。而
F-droid的服务器在外国，所以下载速度会很慢。如果希望能够持续快速更新的话，可以尝
试下载它的客户端更换使用清华源下载。

还有Linux平台（针对Arch用户），Unciv在archlinuxcn源上有已经打包好的软件包可以直
接安装，不用去下载flathub的版本，并且更新频率较高。
*** 下载渠道链接表（备用）
| 系统          | 网站链接    |
|---------------+-------------|
| Windows       | [[https://yairm210.itch.io/unciv][itch.io]]     |
| Android       | [[https://play.google.com/store/apps/details?id=com.unciv.app][Google Play]] |
|               | [[https://f-droid.org/en/packages/com.unciv.app/][F-droid]]     |
| Linux/ +Mac?+ | [[https://flathub.org/apps/details/io.github.yairm210.unciv][Flathub]]     |

* 开始玩Unciv！
** 官方教程
实际上Unciv内置有较为完善的新手引导教程，不懂得也可以去内置的百科里面翻翻，我这
种菜鸡也不好意思在这里班门弄斧。不过我建议，难度先玩移民，慢慢再提上去，要不然轻
轻松松实现《Unciv从入门到退坑》。（注：难度是自上而下增加的，上面简单下面难），
其他的设置保持默认就好。不建议开太大的地图，否则会很卡，文明数量也不建议设置太多。

不过要提一点：建议选择特定的文明玩而非随机，不同的文明是有属性加成的。例如说阿拉
伯会增加石油产量之类的。
** 其他教程
官方虽然给了足够的教程，但是这种教程最多只能帮你打到酋长级别的难度，其他相对难度
需要自身的游戏时间积累的经验才能打过（个人暴论），反正，官方给了新手教程，也只有
新手教程了。我应该会在以后将搜集到有用的内容搜集起来做成笔记存在这一篇文章里。

引用B站上的教程：[[https://space.bilibili.com/387284516/article][处处幻梦-何必认真的个人空间]]
* 转载内容：Unciv黑话
** 领袖
| 称号               | 对应领袖                                                                                           |
|--------------------+----------------------------------------------------------------------------------------------------|
| 媚娘               | 中华领袖武则天                                                                                     |
| 小贝，马脸，小萝莉 | 西班牙领袖伊莎贝拉                                                                                 |
| 小白               | 英格兰领袖伊丽莎白                                                                                 |
| 大妈               | 奥地利领袖特蕾西亚(都是我女婿)                                                                     |
| 砍二               | 阿兹特克领袖蒙特祖玛(塞爱维有一个叫砍头三人组老二的玩家，特别发阿斯特克战报)                       |
| 关二               | 巴比伦领袖尼布甲尼撒二世(胡子很长，长的有点像)                                                     |
| 大波               | 俄罗斯领袖叶卡捷琳娜(对不起，她实在太大了，哦，再看一眼)                                           |
| 人妖               | 暹罗领袖兰甘亨(这不用多说)                                                                         |
| 阿三               | 印度的领袖甘地                                                                                     |
| 花生（炖）         | 美国领袖华盛顿                                                                                     |
| 98女/酒吧女        | 凯尔特领袖布狄卡                                                                                   |
| 拖鞋男，啪嚓哭啼   | 印加领袖帕查库提                                                                                   |
| 乞丐哥             | 玛雅领袖帕卡尔(文明5图像很像乞丐)                                                                  |
| 内裤男             | 波利尼西亚领袖卡美哈梅哈(有几种说法，就穿一条裤衩，脸上的吓人纹身像裤衩，我喜欢叫蝙蝠侠，裤衩套头) |
| 狮子头             | 瑞典领袖古斯塔夫·阿道夫                                                                            |
| 破轮               | 法兰西领袖拿破仑                                                                                   |
| 铁相               | 德意志领袖俾斯麦                                                                                   |
| 油霸               | 阿拉伯领袖哈伦阿希德                                                                               |
| 小黑               | 埃塞俄比亚领袖海尔塞拉西(黑人)                                                                     |
| 海哥               | 易洛魁领袖海华沙                                                                                   |
| 法老               | 埃及领袖拉美西斯二世                                                                               |
| 橘子头             | 荷兰领袖威廉奥兰治                                                                                 |
| 鸭梨               | 希腊领袖亚历山大                                                                                   |
| 大汗               | 蒙古领袖铁木真                                                                                     |
** 英文
| 黑话   | 对应英文                 | 中文解释                                                                                            |
|--------+--------------------------+-----------------------------------------------------------------------------------------------------|
| T      | Turn                     | 回合                                                                                                |
| timing |                          | 时机                                                                                                |
| DLC    | Downloadable Content     | 可下载资料片                                                                                        |
| GK     | Gods Kings               | 神佑君王，文明五第一部资料片                                                                        |
| BNW    | Brave New World          | 美丽新世界，文明五第二部资料片                                                                      |
| UU     | Unique Unit              | 特有单位                                                                                            |
| UA     | Unique Ability           | 特有能力                                                                                            |
| UB     | Unique Building          | 特有建筑                                                                                            |
| UI     | Unique Improvement       | 特有设施                                                                                            |
| MOD    | Modification             | 游戏增强程序，也称模组                                                                              |
| TJ     | Tai Jian                 | 太监，也就是没打完就不玩了                                                                          |
| GG     | Good Game                | 阴阳怪气 在职业竞技比赛中打出有认输的意思                                                           |
| G      | Gold                     | 金，即金钱                                                                                          |
| IGE    | Ingame Editor            | 游戏编辑修改器，一种可以边玩边修改的MOD，功能很强大，毁游戏圣手，除测试外不建议玩家使用也是收心法宝 |
| AI     | artificial intelligence  | 人工智能，这里指电脑玩家                                                                            |
| RA     | Research Agreemnt        | 科研协议                                                                                            |
| SDK    | Software Development Kit | 软件开发工具包，在文明五是地图和MOD的编辑器                                                         |
| GPT    | Gold Per Turn            | 即回合金，也就是你的财政收入                                                                        |
** 奇观
| 黑话/简称      | 解释                   |
|----------------+------------------------|
| 大金           | 大金字塔               |
| 神谕           | 神谕所                 |
| 阿尔忒弥斯神庙 | 吃货庙，弓箭庙，月庙   |
| 勃兰登堡门     | 经验门                 |
| 奇琴伊察       | 齐秦                   |
| 太阳神巨像     | 大铜人                 |
| 大报恩寺塔     | 大陶塔                 |
| 乌鲁汝         | 面包山                 |
| 喀拉喀托火山   | 科研火山               |
| 宗教山         | 西奈山，乌鲁汝，圣足山 |
** 术语与骚操作
| 妹子      | 工人，因为ai打仗会优先抢工人，而不是攻击，工人很有吸引力                                                                   |
| 猴子      | 斥候谐音，也叫狗子，因为文明动画斥候有条狗                                                                                 |
| 勾引大法  | 主动用妹子吸引敌军入冲击等地，夹击再                                                                                       |
| 暴铺      | 多铺城，靠更多城市发展国力的打法                                                                                           |
| 精铺      | 少量铺城，专注发展少量优质城市的打法                                                                                       |
| 魔王流    | 顶着大量红脸继续推进                                                                                                       |
| 蘑菇      | 指不铺城，光发展的AI或玩家，就好像蘑菇一样等人采(荷兰，埃及，玛雅)                                                         |
| 种田      | 和平发展                                                                                                                   |
| 骗宣      | 将手中按回合交付的的资源等换AI手中的现金后宣战，这样你拿到现金而Ai什么都得不到而你获得了现金，本方法在GK时是必会战术       |
| 买宣      | 用金钱等交易让AI宣战别人，但更好用的是堡垒大法                                                                             |
| 堡垒大法  | 用奢侈买宣，然后工人修堡垒终止交易(有内鬼)，之后再修奢侈，一个奢侈买宣全世界                                               |
| 背刺      | 长期友好或中立后突然敌对或宣战(所有的女性首领都不可信，日本是背刺最高等级的，基本和你宣了就等于要开战了)                   |
| 开门      | 启用一个政策树，启用一个政策树会有对应效果                                                                                 |
| 关门      | 采用完一个政策树所有的政策，有对应的效果                                                                                   |
| 黑科技    | 几乎打破游戏平衡的某种东西                                                                                                 |
|           | （比如没改版本的阿兹特克的水上园圃还有15%粮食加成，比粮庙还可怕）                                                          |
|           | （粮庙加砍二ub，前期就有4粮湖，加传统关门）                                                                                |
|           | （猪都长不了这么快）                                                                                                       |
|           | （所以砍二又叫养猪大户）                                                                                                   |
| 刮刮乐    | 劫掠地块设施                                                                                                               |
| 真.刮刮乐 | 大金加自主buff，反复劫掠和维修被烧毁城市留下的地块，最高一回合就刮一次，日进斗金                                           |
| 群狼战术  | 4骑以上，不下城，通过不断劫掠回血，杀光ai有生力量，然后割城                                                                |
| 蝗虫战术  | 砍光所有树林带来产能爆发                                                                                                   |
| 切术      | 通过宗教爆铺提升国力，关键在临城相互传教，人口锁山头，分城看起来被切了下面一样，脱离了低级趣味，普及佛塔刷产出，烂图有奇效 |
|           | （黑白之别在于彻不彻底，黑切就是真切了，拼命的铺，白在于还有其他辅助）                                                     |
|           | （真实原因，开发这个战术的公公，往社区喊）                                                                                 |
|           | （在我这张烂图没有人比的上这个战术）                                                                                       |
|           | （有直播切下体）                                                                                                           |
|           | （后面有人发了更好的打法）                                                                                                 |
|           | （好耶）                                                                                                                   |
| 甘魔王    | 独裁法庭快乐加3，配合印度负面完美抵消，某版本会有bug导致快乐直接变成无限                                                   |
|           | 甘地居然最适合独裁也是醉了                                                                                                 |
* Footnotes

[fn:1] 实际上我觉得这里挺有趣的，Android本身就是由Java编写的，所以约等于已经有了
依赖，不用再装Java环境，所以很小
