post/Games/unciv/Unciv.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<meta name="author" content="不要在意我的头像QwQ" />
<meta name="description" content="一款仿照文明5的开源文明模拟策略游戏" />
<meta name="generator" content="Org Mode (third party program by python)" />
<title>Unciv简介与黑话笔记</title>
<link rel="stylesheet" type="text/css" href="/theme/main.css"/>
<link rel="shortcut icon" href="/img/icon.jpg"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="#"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div>
<div id="content" class="content">
<h1 class="title">Unciv简介与黑话笔记</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul><li><a href="#org-title-1">1. Unciv简介</a><ul><li><a href="#org-title-1-1">1.1. 简介</a></li><li><a href="#org-title-1-2">1.2. 下载&安装</a><ul><li><a href="#org-title-1-2-1">1.2.1. 下载渠道链接表（备用）</a></li></ul></li></ul></li>
<li><a href="#org-title-2">2. 开始玩Unciv！</a><ul><li><a href="#org-title-2-1">2.1. 官方教程</a></li><li><a href="#org-title-2-2">2.2. 其他教程</a></li></ul></li>
<li><a href="#org-title-3">3. 转载内容：Unciv黑话</a><ul><li><a href="#org-title-3-1">3.1. 领袖</a></li><li><a href="#org-title-3-2">3.2. 英文</a></li><li><a href="#org-title-3-3">3.3. 奇观</a></li><li><a href="#org-title-3-4">3.4. 术语与骚操作</a></li></ul></li></ul></div></div>
<div class="outline-2">
<h2 id="org-title-1"><span class="section-number-2">1.</span> Unciv简介</h2>
<div class="outline-3">
<h3 id="org-title-1-1"><span class="section-number-3">1.1.</span> 简介</h3>
<div class="outline-text-3" id="text-1-1"><p>Unciv是一款仿照文明5的，用Java编写的，对模组有好的，易于运行的文明模拟游戏。而其 
<a href="https://github.com/yairm210/Unciv">官网</a>的介绍为：</p><blockquote>
<p>An open source, mod-friendly Android and Desktop remake of Civ V, made with LibGDX</p></blockquote><p>你或许会问：“一个仿制文明5制作的游戏，好玩吗？”实际上，在游戏性上，他是绝对不输文明5的，有着相当完善的功能和玩法。同时，在文章编写时，游戏的开发仍旧非常活跃，能够“肉眼可见”地看见功能的加入和完善——对的，尽管这是一款英文游戏，但是有着很高的翻译完成度，足见玩家的热情。</p></div></div><div class="outline-3">
<h3 id="org-title-1-2"><span class="section-number-3">1.2.</span> 下载&amp;安装</h3>
<div class="outline-text-3" id="text-1-2"><p>它的官网（Github）已经给出了完整的下载渠道，基于Java的特性，它基本支持全平台。抛开Java依赖的大小后，其本体的大小还是非常小的。尽管在官网上Falthub、windows、 android三个平台的安装包大小如下： <code>109M</code><code>85M</code> =19M=<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>。</p><p>值得注意的是，Android平台上建议使用F-droid下载，因为谷歌没有魔法根本连不上。而 F-droid的服务器在外国，所以下载速度会很慢。如果希望能够持续快速更新的话，可以尝试下载它的客户端更换使用清华源下载。</p><p>还有Linux平台（针对Arch用户），Unciv在archlinuxcn源上有已经打包好的软件包可以直接安装，不用去下载flathub的版本，并且更新频率较高。</p></div><div class="outline-4">
<h4 id="org-title-1-2-1"><span class="section-number-4">1.2.1.</span> 下载渠道链接表（备用）</h4>
<div class="outline-text-4" id="text-1-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"><colgroup><col class="org-left" />
<col class="org-left" /></colgroup><thead><tr><th scope="col" class="org-left">系统</th><th scope="col" class="org-left">网站链接</th></tr>
</thead><tbody>
<tr><td class="org-left">Windows</td><td class="org-left"><a href="https://yairm210.itch.io/unciv">itch.io</a></td></tr><tr><td class="org-left">Android</td><td class="org-left"><a href="https://play.google.com/store/apps/details?id=com.unciv.app">Google Play</a></td></tr><tr><td class="org-left">&nbsp;</td><td class="org-left"><a href="https://f-droid.org/en/packages/com.unciv.app/">F-droid</a></td></tr><tr><td class="org-left">Linux/ <del>Mac?</del></td><td class="org-left"><a href="https://flathub.org/apps/details/io.github.yairm210.unciv">Flathub</a></td></tr></table></div></div></div></div><div class="outline-2">
<h2 id="org-title-2"><span class="section-number-2">2.</span> 开始玩Unciv！</h2>
<div class="outline-3">
<h3 id="org-title-2-1"><span class="section-number-3">2.1.</span> 官方教程</h3>
<div class="outline-text-3" id="text-2-1"><p>实际上Unciv内置有较为完善的新手引导教程，不懂得也可以去内置的百科里面翻翻，我这种菜鸡也不好意思在这里班门弄斧。不过我建议，难度先玩移民，慢慢再提上去，要不然轻轻松松实现《Unciv从入门到退坑》。（注：难度是自上而下增加的，上面简单下面难），其他的设置保持默认就好。不建议开太大的地图，否则会很卡，文明数量也不建议设置太多。</p><p>不过要提一点：建议选择特定的文明玩而非随机，不同的文明是有属性加成的。例如说阿拉伯会增加石油产量之类的。</p></div></div><div class="outline-3">
<h3 id="org-title-2-2"><span class="section-number-3">2.2.</span> 其他教程</h3>
<div class="outline-text-3" id="text-2-2"><p>官方虽然给了足够的教程，但是这种教程最多只能帮你打到酋长级别的难度，其他相对难度需要自身的游戏时间积累的经验才能打过（个人暴论），反正，官方给了新手教程，也只有新手教程了。我应该会在以后将搜集到有用的内容搜集起来做成笔记存在这一篇文章里。</p><p>引用B站上的教程：
<a href="https://space.bilibili.com/387284516/article">处处幻梦-何必认真的个人空间</a></p></div></div></div><div class="outline-2">
<h2 id="org-title-3"><span class="section-number-2">3.</span> 转载内容：Unciv黑话</h2>
<div class="outline-3">
<h3 id="org-title-3-1"><span class="section-number-3">3.1.</span> 领袖</h3>
<div class="outline-text-3" id="text-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"><colgroup><col class="org-left" />
<col class="org-left" /></colgroup><thead><tr><th scope="col" class="org-left">称号</th><th scope="col" class="org-left">对应领袖</th></tr>
</thead><tbody>
<tr><td class="org-left">媚娘</td><td class="org-left">中华领袖武则天</td></tr><tr><td class="org-left">小贝，马脸，小萝莉</td><td class="org-left">西班牙领袖伊莎贝拉</td></tr><tr><td class="org-left">小白</td><td class="org-left">英格兰领袖伊丽莎白</td></tr><tr><td class="org-left">大妈</td><td class="org-left">奥地利领袖特蕾西亚(都是我女婿)</td></tr><tr><td class="org-left">砍二</td><td class="org-left">阿兹特克领袖蒙特祖玛(塞爱维有一个叫砍头三人组老二的玩家，特别发阿斯特克战报)</td></tr><tr><td class="org-left">关二</td><td class="org-left">巴比伦领袖尼布甲尼撒二世(胡子很长，长的有点像)</td></tr><tr><td class="org-left">大波</td><td class="org-left">俄罗斯领袖叶卡捷琳娜(对不起，她实在太大了，哦，再看一眼)</td></tr><tr><td class="org-left">人妖</td><td class="org-left">暹罗领袖兰甘亨(这不用多说)</td></tr><tr><td class="org-left">阿三</td><td class="org-left">印度的领袖甘地</td></tr><tr><td class="org-left">花生（炖）</td><td class="org-left">美国领袖华盛顿</td></tr><tr><td class="org-left">98女/酒吧女</td><td class="org-left">凯尔特领袖布狄卡</td></tr><tr><td class="org-left">拖鞋男，啪嚓哭啼</td><td class="org-left">印加领袖帕查库提</td></tr><tr><td class="org-left">乞丐哥</td><td class="org-left">玛雅领袖帕卡尔(文明5图像很像乞丐)</td></tr><tr><td class="org-left">内裤男</td><td class="org-left">波利尼西亚领袖卡美哈梅哈(有几种说法，就穿一条裤衩，脸上的吓人纹身像裤衩，我喜欢叫蝙蝠侠，裤衩套头)</td></tr><tr><td class="org-left">狮子头</td><td class="org-left">瑞典领袖古斯塔夫·阿道夫</td></tr><tr><td class="org-left">破轮</td><td class="org-left">法兰西领袖拿破仑</td></tr><tr><td class="org-left">铁相</td><td class="org-left">德意志领袖俾斯麦</td></tr><tr><td class="org-left">油霸</td><td class="org-left">阿拉伯领袖哈伦阿希德</td></tr><tr><td class="org-left">小黑</td><td class="org-left">埃塞俄比亚领袖海尔塞拉西(黑人)</td></tr><tr><td class="org-left">海哥</td><td class="org-left">易洛魁领袖海华沙</td></tr><tr><td class="org-left">法老</td><td class="org-left">埃及领袖拉美西斯二世</td></tr><tr><td class="org-left">橘子头</td><td class="org-left">荷兰领袖威廉奥兰治</td></tr><tr><td class="org-left">鸭梨</td><td class="org-left">希腊领袖亚历山大</td></tr><tr><td class="org-left">大汗</td><td class="org-left">蒙古领袖铁木真</td></tr></table></div></div><div class="outline-3">
<h3 id="org-title-3-2"><span class="section-number-3">3.2.</span> 英文</h3>
<div class="outline-text-3" id="text-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"><colgroup><col class="org-left" />
<col class="org-left" />
<col class="org-left" /></colgroup><thead><tr><th scope="col" class="org-left">黑话</th><th scope="col" class="org-left">对应英文</th><th scope="col" class="org-left">中文解释</th></tr>
</thead><tbody>
<tr><td class="org-left">T</td><td class="org-left">Turn</td><td class="org-left">回合</td></tr><tr><td class="org-left">timing</td><td class="org-left">&nbsp;</td><td class="org-left">时机</td></tr><tr><td class="org-left">DLC</td><td class="org-left">Downloadable Content</td><td class="org-left">可下载资料片</td></tr><tr><td class="org-left">GK</td><td class="org-left">Gods Kings</td><td class="org-left">神佑君王，文明五第一部资料片</td></tr><tr><td class="org-left">BNW</td><td class="org-left">Brave New World</td><td class="org-left">美丽新世界，文明五第二部资料片</td></tr><tr><td class="org-left">UU</td><td class="org-left">Unique Unit</td><td class="org-left">特有单位</td></tr><tr><td class="org-left">UA</td><td class="org-left">Unique Ability</td><td class="org-left">特有能力</td></tr><tr><td class="org-left">UB</td><td class="org-left">Unique Building</td><td class="org-left">特有建筑</td></tr><tr><td class="org-left">UI</td><td class="org-left">Unique Improvement</td><td class="org-left">特有设施</td></tr><tr><td class="org-left">MOD</td><td class="org-left">Modification</td><td class="org-left">游戏增强程序，也称模组</td></tr><tr><td class="org-left">TJ</td><td class="org-left">Tai Jian</td><td class="org-left">太监，也就是没打完就不玩了</td></tr><tr><td class="org-left">GG</td><td class="org-left">Good Game</td><td class="org-left">阴阳怪气 在职业竞技比赛中打出有认输的意思</td></tr><tr><td class="org-left">G</td><td class="org-left">Gold</td><td class="org-left">金，即金钱</td></tr><tr><td class="org-left">IGE</td><td class="org-left">Ingame Editor</td><td class="org-left">游戏编辑修改器，一种可以边玩边修改的MOD，功能很强大，毁游戏圣手，除测试外不建议玩家使用也是收心法宝</td></tr><tr><td class="org-left">AI</td><td class="org-left">artificial intelligence</td><td class="org-left">人工智能，这里指电脑玩家</td></tr><tr><td class="org-left">RA</td><td class="org-left">Research Agreemnt</td><td class="org-left">科研协议</td></tr><tr><td class="org-left">SDK</td><td class="org-left">Software Development Kit</td><td class="org-left">软件开发工具包，在文明五是地图和MOD的编辑器</td></tr><tr><td class="org-left">GPT</td><td class="org-left">Gold Per Turn</td><td class="org-left">即回合金，也就是你的财政收入</td></tr></table></div></div><div class="outline-3">
<h3 id="org-title-3-3"><span class="section-number-3">3.3.</span> 奇观</h3>
<div class="outline-text-3" id="text-3-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"><colgroup><col class="org-left" />
<col class="org-left" /></colgroup><thead><tr><th scope="col" class="org-left">黑话/简称</th><th scope="col" class="org-left">解释</th></tr>
</thead><tbody>
<tr><td class="org-left">大金</td><td class="org-left">大金字塔</td></tr><tr><td class="org-left">神谕</td><td class="org-left">神谕所</td></tr><tr><td class="org-left">阿尔忒弥斯神庙</td><td class="org-left">吃货庙，弓箭庙，月庙</td></tr><tr><td class="org-left">勃兰登堡门</td><td class="org-left">经验门</td></tr><tr><td class="org-left">奇琴伊察</td><td class="org-left">齐秦</td></tr><tr><td class="org-left">太阳神巨像</td><td class="org-left">大铜人</td></tr><tr><td class="org-left">大报恩寺塔</td><td class="org-left">大陶塔</td></tr><tr><td class="org-left">乌鲁汝</td><td class="org-left">面包山</td></tr><tr><td class="org-left">喀拉喀托火山</td><td class="org-left">科研火山</td></tr><tr><td class="org-left">宗教山</td><td class="org-left">西奈山，乌鲁汝，圣足山</td></tr></table></div></div><div class="outline-3">
<h3 id="org-title-3-4"><span class="section-number-3">3.4.</span> 术语与骚操作</h3>
<div class="outline-text-3" id="text-3-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"><colgroup><col class="org-left" />
<col class="org-left" /></colgroup><tbody><tr><td class="org-left">妹子</td><td class="org-left">工人，因为ai打仗会优先抢工人，而不是攻击，工人很有吸引力</td></tr><tr><td class="org-left">猴子</td><td class="org-left">斥候谐音，也叫狗子，因为文明动画斥候有条狗</td></tr><tr><td class="org-left">勾引大法</td><td class="org-left">主动用妹子吸引敌军入冲击等地，夹击再</td></tr><tr><td class="org-left">暴铺</td><td class="org-left">多铺城，靠更多城市发展国力的打法</td></tr><tr><td class="org-left">精铺</td><td class="org-left">少量铺城，专注发展少量优质城市的打法</td></tr><tr><td class="org-left">魔王流</td><td class="org-left">顶着大量红脸继续推进</td></tr><tr><td class="org-left">蘑菇</td><td class="org-left">指不铺城，光发展的AI或玩家，就好像蘑菇一样等人采(荷兰，埃及，玛雅)</td></tr><tr><td class="org-left">种田</td><td class="org-left">和平发展</td></tr><tr><td class="org-left">骗宣</td><td class="org-left">将手中按回合交付的的资源等换AI手中的现金后宣战，这样你拿到现金而Ai什么都得不到而你获得了现金，本方法在GK时是必会战术</td></tr><tr><td class="org-left">买宣</td><td class="org-left">用金钱等交易让AI宣战别人，但更好用的是堡垒大法</td></tr><tr><td class="org-left">堡垒大法</td><td class="org-left">用奢侈买宣，然后工人修堡垒终止交易(有内鬼)，之后再修奢侈，一个奢侈买宣全世界</td></tr><tr><td class="org-left">背刺</td><td class="org-left">长期友好或中立后突然敌对或宣战(所有的女性首领都不可信，日本是背刺最高等级的，基本和你宣了就等于要开战了)</td></tr><tr><td class="org-left">开门</td><td class="org-left">启用一个政策树，启用一个政策树会有对应效果</td></tr><tr><td class="org-left">关门</td><td class="org-left">采用完一个政策树所有的政策，有对应的效果</td></tr><tr><td class="org-left">黑科技</td><td class="org-left">几乎打破游戏平衡的某种东西</td></tr><tr><td class="org-left">&nbsp;</td><td class="org-left">（比如没改版本的阿兹特克的水上园圃还有15%粮食加成，比粮庙还可怕）</td></tr><tr><td class="org-left">&nbsp;</td><td class="org-left">（粮庙加砍二ub，前期就有4粮湖，加传统关门）</td></tr><tr><td class="org-left">&nbsp;</td><td class="org-left">（猪都长不了这么快）</td></tr><tr><td class="org-left">&nbsp;</td><td class="org-left">（所以砍二又叫养猪大户）</td></tr><tr><td class="org-left">刮刮乐</td><td class="org-left">劫掠地块设施</td></tr><tr><td class="org-left">真.刮刮乐</td><td class="org-left">大金加自主buff，反复劫掠和维修被烧毁城市留下的地块，最高一回合就刮一次，日进斗金</td></tr><tr><td class="org-left">群狼战术</td><td class="org-left">4骑以上，不下城，通过不断劫掠回血，杀光ai有生力量，然后割城</td></tr><tr><td class="org-left">蝗虫战术</td><td class="org-left">砍光所有树林带来产能爆发</td></tr><tr><td class="org-left">切术</td><td class="org-left">通过宗教爆铺提升国力，关键在临城相互传教，人口锁山头，分城看起来被切了下面一样，脱离了低级趣味，普及佛塔刷产出，烂图有奇效</td></tr><tr><td class="org-left">&nbsp;</td><td class="org-left">（黑白之别在于彻不彻底，黑切就是真切了，拼命的铺，白在于还有其他辅助）</td></tr><tr><td class="org-left">&nbsp;</td><td class="org-left">（真实原因，开发这个战术的公公，往社区喊）</td></tr><tr><td class="org-left">&nbsp;</td><td class="org-left">（在我这张烂图没有人比的上这个战术）</td></tr><tr><td class="org-left">&nbsp;</td><td class="org-left">（有直播切下体）</td></tr><tr><td class="org-left">&nbsp;</td><td class="org-left">（后面有人发了更好的打法）</td></tr><tr><td class="org-left">&nbsp;</td><td class="org-left">（好耶）</td></tr><tr><td class="org-left">甘魔王</td><td class="org-left">独裁法庭快乐加3，配合印度负面完美抵消，某版本会有bug导致快乐直接变成无限</td></tr><tr><td class="org-left">&nbsp;</td><td class="org-left">甘地居然最适合独裁也是醉了</td></tr></table></div></div></div><div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<div class="footdef">
<sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup>
<div class="footpara" role="doc-footnote"> 实际上我觉得这里挺有趣的，Android本身就是由Java编写的，所以约等于已经有了
<p class="footpara">依赖，不用再装Java环境，所以很小</p></div>
</div></div></div></div>
<div id="postamble" class="status"><p class="date">时间: <2023-06-07 三 11:58></p>
<p class="author">作者: 不要在意我的头像QwQ</p>
<p class="description">描述: 一款仿照文明5的开源文明模拟策略游戏</p>
<p class="date">生成于: 2025-08-21 五 14:49:17</p>
</div>
</body>
</html>